zeranemesis/Marioparty4/partyboard/src/REL/m409Dll/main.c
#include "REL/m409Dll.h"

#include "ext_math.h"
#include "game/audio.h"
#include "game/gamework_data.h"
#include "game/hu3d.h"
#include "game/minigame_seq.h"
#include "game/objsub.h"
#include "game/pad.h"
#include "game/sprite.h"
#include "game/wipe.h"

#include "math.h"
#include <string.h>

// bss
Process *lbl_1_bss_E8;
s16 lbl_1_bss_E4;
omObjData *lbl_1_bss_E0;
omObjData *lbl_1_bss_DC;
Vec lbl_1_bss_D0;
unkStruct4 lbl_1_bss_40[4];
s32 lbl_1_bss_3C;
unkStruct3 lbl_1_bss_24;
s8 lbl_1_bss_21;
u8 lbl_1_bss_20;
f32 lbl_1_bss_1C;
f32 lbl_1_bss_18;
s16 lbl_1_bss_16;
s8 lbl_1_bss_14;
f32 lbl_1_bss_10;
f32 lbl_1_bss_C;
s8 lbl_1_bss_A;
s16 lbl_1_bss_8;
s8 lbl_1_bss_6;
s16 lbl_1_bss_4;
s16 lbl_1_bss_2;
s8 lbl_1_bss_0;

// data
Vec lbl_1_data_0 = { 800.0f, 1300.0f, 1000.0f };
Vec lbl_1_data_C = { 0.0f, 0.0f, 0.0f };
unkStruct2 lbl_1_data_18 = { { 0xFF, 0xFF, 0xFF, 0xFF }, { 10.0f, 45.0f, 0.0f } };
Vec lbl_1_data_28 = { 1300.0f, 2500.0f, 1300.0f };
Vec lbl_1_data_34 = { 0.0f, 1.0f, 0.0f };
Vec lbl_1_data_40 = { 0.0f, 0.0f, -1200.0f };
unkStruct lbl_1_data_4C[4]
    = { { 469.8f, { 225.0f, 184.0f, -1358.0f }, { 10.62f, -109.0f, 0.0f } }, { 1800.0f, { 0.0f, 300.0f, -1316.0f }, { -20.38f, 0.0f, 0.0f } },
          { 2209.82f, { 0.0f, 478.0f, -1316.0f }, { 4.62f, 0.0f, 0.0f } }, { 2059.82f, { 0.0f, 528.0f, -1316.0f }, { 10.62f, 0.0f, 0.0f } } };
u32 lbl_1_data_BC = 0xFFFFFFFF;
s32 lbl_1_data_C0 = -1;

void ObjectSetup(void)
{
    Vec sp2C;
    Vec sp20;
    Vec sp14;
    Vec sp8;
    HU3DLIGHT *temp_r31;

    Hu3DLightAllKill();
    lbl_1_bss_E4 = Hu3DGLightCreateV(&lbl_1_data_0, &lbl_1_data_C, &lbl_1_data_18.unk0);
    Hu3DGLightInfinitytSet(lbl_1_bss_E4);
    temp_r31 = &Hu3DGlobalLight[lbl_1_bss_E4];
    temp_r31->type |= 0x8000;
    sp2C.x = sp2C.y = sp2C.z = 0.0f;
    Hu3DGLightPosAimSetV(lbl_1_bss_E4, &lbl_1_data_0, &sp2C);
    Hu3DShadowCreate(45.0f, 20.0f, 10000.0f);
    Hu3DShadowTPLvlSet(0.8f);
    Hu3DShadowPosSet(&lbl_1_data_28, &lbl_1_data_34, &lbl_1_data_40);
    lbl_1_bss_E8 = omInitObjMan(0x32, 0x2000);
    omGameSysInit(lbl_1_bss_E8);
    Hu3DCameraCreate(1);
    Hu3DCameraPerspectiveSet(1, 41.5f, 5.0f, 5000.0f, 1.2f);
    omAddObjEx(lbl_1_bss_E8, 0x7FDA, 0U, 0U, -1, omOutView);
    sp14.x = 0.0f;
    sp14.y = 374.0f;
    sp14.z = 1086.0f;
    sp20.x = 0.0f;
    sp20.y = 568.0f;
    sp20.z = -1316.0f;
    sp8.z = sp20.x - sp14.x;
    sp8.y = sp20.y - sp14.y;
    sp8.x = sp20.z - sp14.z;
    CRot.x = lbl_1_data_4C[0].rot.x;
    CRot.y = lbl_1_data_4C[0].rot.y;
    CRot.z = lbl_1_data_4C[0].rot.z;
    Center.x = lbl_1_data_4C[0].center.x;
    Center.y = lbl_1_data_4C[0].center.y;
    Center.z = lbl_1_data_4C[0].center.z;
    CZoom = lbl_1_data_4C[0].zoom;
    omAddObjEx(lbl_1_bss_E8, 0x3E8, 0, 0, -1, fn_1_434);
    lbl_1_bss_E0 = omAddObjEx(lbl_1_bss_E8, 0xA, 3U, 0U, -1, fn_1_DDC);
    lbl_1_bss_DC = omAddObjEx(lbl_1_bss_E8, 0x32, 7U, 0U, -1, fn_1_2484);
    Hu3DBGColorSet(0, 0, 0);
    HuAudSndGrpSet(0x22);
    fn_1_67E0(lbl_1_bss_E8);
}

void fn_1_434(omObjData *object)
{
    if ((omSysExitReq != 0) || (lbl_1_bss_0 != 0)) {
        HuAudFXListnerKill();
#if VERSION_NTSC
        fn_1_5F5C(lbl_1_bss_E0->model[0]);
        fn_1_5F5C(lbl_1_bss_E0->model[1]);
#endif
        WipeCreate(WIPE_MODE_OUT, WIPE_TYPE_NORMAL, 0x3C);
        MGSeqKillAll();
        object->func = fn_1_4DC;
    }
}

void fn_1_4DC(omObjData *object)
{
    if ((WipeStatGet() == 0) && (MGSeqDoneCheck() != 0)) {
        fn_1_6900();
#if VERSION_PAL
        fn_1_5F5C(lbl_1_bss_E0->model[0]);
        fn_1_5F5C(lbl_1_bss_E0->model[1]);
#endif
        omOvlReturnEx(1, 1);
    }
}

s8 fn_1_524(void)
{
    Vec sp8;
    f32 temp_f29;
    f32 var_f30;
    f32 temp_f31;
    s8 var_r30;
    unkStruct *var_r31;

    var_r31 = lbl_1_data_4C;
    var_r30 = 0;
    if (++lbl_1_bss_2 > 0x12C) {
        lbl_1_bss_2 = 0x12C;
        var_r30 = 1;
    }
    var_f30 = lbl_1_bss_2 / 300.0f;
    temp_f31 = sind(90.0f * var_f30) * sind(90.0f * var_f30);
    CZoom = fn_1_4120(var_r31[0].zoom, var_r31[1].zoom, var_r31[2].zoom, temp_f31);
    Center.x = fn_1_4120(var_r31[0].center.x, var_r31[1].center.x, var_r31[2].center.x, temp_f31);
    Center.y = fn_1_4120(var_r31[0].center.y, var_r31[1].center.y, var_r31[2].center.y, temp_f31);
    Center.z = fn_1_4120(var_r31[0].center.z, var_r31[1].center.z, var_r31[2].center.z, temp_f31);
    CRot.x = fn_1_4120(var_r31[0].rot.x, var_r31[1].rot.x, var_r31[2].rot.x, temp_f31);
    CRot.y = fn_1_4120(var_r31[0].rot.y, var_r31[1].rot.y, var_r31[2].rot.y, temp_f31);
    CRot.z = fn_1_4120(var_r31[0].rot.z, var_r31[1].rot.z, var_r31[2].rot.z, temp_f31);
    if (var_f30 > 0.65f) {
        Hu3DModelAttrSet(lbl_1_bss_DC->model[1], HU3D_ATTR_DISPOFF);
    }
    temp_f29 = var_r31[0].rot.x + (-var_r31[0].rot.x * temp_f31);
    Hu3DModelRotSet(lbl_1_bss_DC->model[2], 0.2f * temp_f29, 0.85f * CRot.y, 0.0f);
    Hu3DModelRotSet(lbl_1_bss_DC->model[3], 0.2f * temp_f29, 0.85f * CRot.y, 0.0f);
    Hu3DModelRotSet(lbl_1_bss_DC->model[6], 0.2f * temp_f29, 0.85f * CRot.y, 0.0f);
    var_f30 *= 1.2f;
    if (var_f30 > 1.0f) {
        var_f30 = 1.0f;
    }
    temp_f31 = cosd(-45.0f + (135.0f * var_f30));
    Hu3DTexScrollPosSet(lbl_1_bss_24.unk12, lbl_1_bss_24.unk14, 0.0f, 0.0f);
    lbl_1_bss_24.unk14 -= 0.01f * temp_f31;
    Hu3DTexScrollPosMoveSet(lbl_1_bss_24.unkC, -0.0001f - (0.005f * temp_f31), 0.0f, 0.0f);
    Hu3DTexScrollPosMoveSet(lbl_1_bss_24.unkE, -0.0002f - (0.005f * temp_f31), 0.0f, 0.0f);
    Hu3DTexScrollPosMoveSet(lbl_1_bss_24.unk10, -0.0003f - (0.005f * temp_f31), 0.0f, 0.0f);
    sp8.x = -(sind(CRot.y) * cosd(CRot.x));
    sp8.y = sind(CRot.x);
    sp8.z = -(cosd(CRot.y) * cosd(CRot.x));
    HuAudFXListnerUpdate(&Hu3DCamera->pos, &sp8);
    return var_r30;
}

s8 fn_1_B80(void)
{
    f32 temp_f30;
    f32 temp_f31;
    s8 var_r30;
    unkStruct *var_r31;

    var_r31 = &lbl_1_data_4C[2];
    var_r30 = 0;
    if (++lbl_1_bss_4 > 0x3C) {
        lbl_1_bss_4 = 0x3C;
        var_r30 = 1;
    }
    temp_f30 = lbl_1_bss_4 / 60.0f;
    temp_f31 = sind(90.0f * temp_f30) * sind(90.0f * temp_f30);
    CZoom = var_r31[0].zoom + (temp_f31 * (var_r31[1].zoom - var_r31[0].zoom));
    Center.x = var_r31[0].center.x + (temp_f31 * (var_r31[1].center.x - var_r31[0].center.x));
    Center.y = var_r31[0].center.y + (temp_f31 * (var_r31[1].center.y - var_r31[0].center.y));
    Center.z = var_r31[0].center.z + (temp_f31 * (var_r31[1].center.z - var_r31[0].center.z));
    CRot.x = var_r31[0].rot.x + (temp_f31 * (var_r31[1].rot.x - var_r31[0].rot.x));
    CRot.y = var_r31[0].rot.y + (temp_f31 * (var_r31[1].rot.y - var_r31[0].rot.y));
    CRot.z = var_r31[0].rot.z + (temp_f31 * (var_r31[1].rot.z - var_r31[0].rot.z));
    return var_r30;
}

