zeranemesis/Marioparty4/partyboard/src/REL/m409Dll/main.c
void fn_1_2098(omObjData *object)
{
    f32 var_f28;
    f32 var_f29;
    f32 var_f31;
    f32 var_f30;

    HU3DMODEL *temp_r31 = &Hu3DData[lbl_1_bss_DC->model[4]];
    if (fn_1_2454(0x18) != 0x18) {
        lbl_1_bss_18 += 0.008f;
        if (lbl_1_bss_18 >= 1.0f) {
            fn_1_2414(0x60, 0x40);
            Hu3DModelAttrSet(lbl_1_bss_DC->model[4], HU3D_ATTR_DISPOFF);
            lbl_1_bss_18 = 1.0f;
        }
        var_f31 = sind(90.0f * lbl_1_bss_18);
        var_f29 = -1030.0f;
        var_f28 = -1880.0f;
        var_f30 = var_f29 + (var_f31 * (var_f28 - var_f29));
        Hu3DModelPosSet(lbl_1_bss_DC->model[4], var_f30, 0.0f, -1200.0f);
        Hu3DMotionSpeedSet(lbl_1_bss_DC->model[4], 3.0f * var_f31);
        var_f31 = (4.0f * (9.0f * lbl_1_bss_18));
        fn_1_44F0(lbl_1_bss_E0->model[0], 0.0f, 0.0f, 0.0f, 0, var_f31);
        fn_1_44F0(lbl_1_bss_E0->model[0], 190.0f + var_f30, 15.0f, 95.0f + temp_r31->pos.z, 1, 1);
        fn_1_44F0(lbl_1_bss_E0->model[0], 370.0f + var_f30, 15.0f, 95.0f + temp_r31->pos.z, 1, 1);
        fn_1_44F0(lbl_1_bss_E0->model[0], 490.0f + var_f30, 15.0f, 95.0f + temp_r31->pos.z, 1, 1);
    }
}

void fn_1_23EC(s16 arg0)
{
    unkStruct4 *var_r31;

    var_r31 = (unkStruct4 *)lbl_1_bss_E0->data;
    var_r31->unk4 = arg0;
}

void fn_1_2414(u16 arg0, u16 arg1)
{
    unkStruct4 *var_r31;

    var_r31 = (unkStruct4 *)lbl_1_bss_E0->data;
    var_r31->unk0 &= ~arg0;
    var_r31->unk0 |= arg1;
}

u16 fn_1_2454(u16 arg0)
{
    unkStruct4 *var_r31;

    var_r31 = (unkStruct4 *)lbl_1_bss_E0->data;
    return var_r31->unk0 & arg0;
}

static inline void unkInline(unkStruct4 *var_r31, s16 var_r29, s16 *var_r28, s16 arg3)
{
    var_r31[var_r29].unk2 = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M409, 0x02));
    var_r31[var_r29].unk4 = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M409, 0x03));
    Hu3DModelAttrSet(var_r31[var_r29].unk2, HU3D_MOTATTR_LOOP);
    Hu3DModelAttrSet(var_r31[var_r29].unk4, HU3D_MOTATTR_PAUSE);
    if (arg3) {
        Hu3DModelAttrSet(var_r31[var_r29].unk2, HU3D_ATTR_DISPOFF);
        Hu3DModelAttrSet(var_r31[var_r29].unk4, HU3D_ATTR_DISPOFF);
    }
    var_r31[var_r29].unk6 = Hu3DModelCreateFile(0x2001C);
    var_r31[var_r29].unk8 = Hu3DJointMotionFile(var_r31[var_r29].unk6, DATA_MAKE_NUM(DATADIR_M409, 11));
    var_r31[var_r29].unkA = Hu3DJointMotionFile(var_r31[var_r29].unk6, DATA_MAKE_NUM(DATADIR_M409, 12));
    Hu3DModelAttrSet(var_r31[var_r29].unk6, HU3D_MOTATTR_LOOP);
    Hu3DMotionSet(var_r31[var_r29].unk6, var_r31[var_r29].unk8);
    var_r31[var_r29].unkC = var_r29 + 3;
    if (arg3) {
        *var_r28 += (((rand8() << 8) | rand8()) % 4) + 2;
    }
    else {
        *var_r28 = 2;
    }
    fn_1_3988(&var_r31[var_r29], *var_r28, var_r29);
    Hu3DModelPosSet(var_r31[var_r29].unk2, var_r31[var_r29].unk18, 0.0f, -1200.0f);
    Hu3DModelPosSet(var_r31[var_r29].unk4, var_r31[var_r29].unk18, 0.0f, -1200.0f);
}

void fn_1_2484(omObjData *object)
{
    s16 var_r28; // ! - uninitialized
    s16 var_r29;
    unkStruct4 *var_r31;

    var_r31 = &lbl_1_bss_40[0];
    object->stat |= 0x100;
    object->model[0] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M409, 0x00));
    object->model[5] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M409, 0x08));
    Hu3DModelLayerSet(object->model[0], 2);
    Hu3DModelLayerSet(object->model[5], 2);
    object->model[2] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M409, 0x05));
    object->model[3] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M409, 0x06));
    Hu3DModelScaleSet(object->model[2], 1.1f, 1.0f, 1.0f);
    Hu3DModelScaleSet(object->model[3], 1.1f, 1.0f, 1.0f);
    Hu3DModelRotSet(object->model[2], 0.2f * lbl_1_data_4C->rot.x, 0.85f * lbl_1_data_4C->rot.y, 0.0f);
    Hu3DModelRotSet(object->model[3], 0.2f * lbl_1_data_4C->rot.x, 0.85f * lbl_1_data_4C->rot.y, 0.0f);
    Hu3DModelLayerSet(object->model[2], 2);
    Hu3DModelLayerSet(object->model[3], 2);
    lbl_1_bss_24.unkE = Hu3DTexScrollCreate(object->model[2], "cr_kumo2");
    Hu3DTexScrollPosMoveSet(lbl_1_bss_24.unkE, -0.0002f, 0.0f, 0.0f);
    lbl_1_bss_24.unk10 = Hu3DTexScrollCreate(object->model[3], "cr_kumo3");
    Hu3DTexScrollPosMoveSet(lbl_1_bss_24.unk10, -0.0003f, 0.0f, 0.0f);
    var_r29 = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M409, 0x0A));
    Hu3DModelLayerSet(var_r29, 0);
    object->model[6] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M409, 0x07));
    Hu3DModelAttrSet(object->model[6], HU3D_ATTR_ZWRITE_OFF);
    Hu3DModelScaleSet(object->model[6], 1.1f, 1.0f, 1.0f);
    Hu3DModelRotSet(object->model[6], 0.2f * lbl_1_data_4C->rot.x, 0.85f * lbl_1_data_4C->rot.y, 0.0f);
    Hu3DModelLayerSet(object->model[6], 1);
    lbl_1_bss_24.unk12 = Hu3DTexScrollCreate(object->model[6], "bg");
    lbl_1_bss_24.unk14 = 0.0f;
    object->model[4] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M409, 0x01));
    object->model[1] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M409, 0x04));
    Hu3DModelAttrSet(object->model[4], HU3D_MOTATTR_LOOP);
    Hu3DModelPosSet(object->model[4], 1660.0f, 0.0f, -1200.0f);
    Hu3DModelPosSet(object->model[1], 1660.0f, 0.0f, -1200.0f);
    Hu3DModelLayerSet(object->model[1], 6);
    Hu3DModelAttrSet(object->model[1], HU3D_MOTATTR_PAUSE);

    unkInline(var_r31, 0, &var_r28, 0);
    for (var_r29 = 1; var_r29 < 4; var_r29++) {
        unkInline(var_r31, var_r29, &var_r28, 1);
    }

    lbl_1_bss_24.unk0 = 0;
    lbl_1_bss_24.unk1 = 0;
    lbl_1_bss_24.unk8 = 0;
    lbl_1_bss_24.unkA = 0xB4;
    Hu3DModelShadowMapSet(object->model[0]);
    Hu3DModelShadowSet(object->model[4]);

    for (var_r29 = 0; var_r29 < 4; var_r29++) {
        Hu3DModelShadowSet(var_r31[var_r29].unk2);
        Hu3DModelShadowSet(var_r31[var_r29].unk4);
    }
    lbl_1_bss_3C = 0;
    object->func = fn_1_2DCC;
}

void fn_1_2DCC(omObjData *object)
{
    HU3DMODEL *temp_r30;
    f32 temp_f29;
    f32 var_f31;
    f32 var_f30;
    s16 var_r22;
    s16 var_r23;
    s16 var_r28;
    s16 var_r27;
    s16 var_r29;
    unkStruct4 *var_r31;

    if ((lbl_1_bss_24.unk0 == 0) || (fn_1_2454(0x18) == 0x18)) {
        if (lbl_1_bss_24.unk1 != 0) {
            var_r31 = lbl_1_bss_24.unk4;
            switch (lbl_1_bss_24.unk1) {
                case 1:
                    if (++lbl_1_bss_24.unk8 == (lbl_1_bss_24.unkA - 5)) {
                        Hu3DMotionSet(var_r31->unk6, var_r31->unkA);
                        Hu3DModelAttrReset(var_r31->unk6, HU3D_MOTATTR_LOOP);
                        lbl_1_bss_3C++;
                        break;
                    }
                    if (lbl_1_bss_24.unk8 > lbl_1_bss_24.unkA) {
                        lbl_1_bss_24.unk8 = 0;
                        lbl_1_bss_24.unkA = 0xF;
                        Hu3DModelAttrReset(var_r31->unk4, HU3D_MOTATTR_PAUSE);
                        lbl_1_bss_24.unk1 = 2;
                        HuAudFXPlay(0x55B);
                        HuAudFXPlay(0x55D);
                    }
                    break;
                case 2:
                    temp_f29 = Hu3DMotionMaxTimeGet(var_r31->unk4);
                    if (Hu3DMotionTimeGet(var_r31->unk4) >= temp_f29) {
                        Hu3DMotionSet(var_r31->unk6, var_r31->unk8);
                        Hu3DModelAttrSet(var_r31->unk6, HU3D_MOTATTR_LOOP);
                        Hu3DModelAttrSet(var_r31->unk4, HU3D_MOTATTR_PAUSE);
                        fn_1_2414(24, 8);
                        lbl_1_bss_24.unk1 = 0;
                    }
                    break;
            }
        }
        else {
            var_r31 = lbl_1_bss_24.unk4;
            switch (fn_1_2454(0x18)) {
                case 16:
                    Hu3DMotionSet(var_r31->unk6, var_r31->unkA);
                    Hu3DMotionTimeSet(var_r31->unk6, Hu3DMotionMaxTimeGet(var_r31->unk6));
                    Hu3DMotionSpeedSet(var_r31->unk6, -1.0f);
                    Hu3DModelAttrReset(var_r31->unk6, HU3D_MOTATTR_LOOP);
                    Hu3DMotionSpeedSet(var_r31->unk4, -1.0f);
                    Hu3DModelAttrReset(var_r31->unk4, HU3D_MOTATTR_PAUSE);
                    fn_1_2414(24, 0x18);
                    HuAudFXPlay(0x55C);
                    HuAudFXPlay(0x55D);
                    break;
                case 24:
                    if (Hu3DMotionTimeGet(var_r31->unk4) <= 0.0f) {
                        Hu3DMotionSet(var_r31->unk6, var_r31->unk8);
                        Hu3DMotionSpeedSet(var_r31->unk6, 1.0f);
                        Hu3DModelAttrSet(var_r31->unk6, HU3D_MOTATTR_LOOP);
                        Hu3DMotionSpeedSet(var_r31->unk4, 1.0f);
                        Hu3DModelAttrSet(var_r31->unk4, HU3D_MOTATTR_PAUSE);
                        fn_1_2414(24, 0);
                    }
                    break;
            }
        }
    }
    else {
        if (fn_1_2454(7) == 2) {
            var_f30 = 0.004f;
        }
        else {
            var_f30 = 0.008f;
        }
        var_r29 = 0;
        var_r23 = 0;
        var_r31 = lbl_1_bss_40;

        for (; var_r29 < 4; var_r29++, var_r31++) {
            if ((s8)var_r31->unk0b == 0) {
                var_r23++;
            }
            else {
                if (var_r31->unkE-- <= 0) {
                    temp_r30 = &Hu3DData[var_r31->unk2];
                    if ((var_r31->unkC < 2) && (lbl_1_bss_3C < 0xBU)) {
                        Hu3DModelAttrReset(var_r31->unk2, HU3D_ATTR_DISPOFF);
                        Hu3DModelAttrReset(var_r31->unk4, HU3D_ATTR_DISPOFF);
                        Hu3DModelAttrReset(var_r31->unk6, HU3D_ATTR_DISPOFF);
                    }
                    var_r31->unk10 += var_f30;
                    var_f31 = sind(90.0f * var_r31->unk10);
                    if (var_r31->unk10 >= 1.0f) {
                        var_f31 = 1.0f;
                        var_r31->unk10 = var_f31;
                        temp_r30->pos.x = var_r31->unk1C;
                        if (var_r31->unkC == 0) {
                            lbl_1_bss_24.unk4 = var_r31;
                        }
                        var_r27 = var_r31->unkC - 1;
                        if (var_r27 == -3) {
                            Hu3DModelAttrSet(var_r31->unk2, HU3D_ATTR_DISPOFF);
                            Hu3DModelAttrSet(var_r31->unk4, HU3D_ATTR_DISPOFF);
                            Hu3DModelAttrSet(var_r31->unk6, HU3D_ATTR_DISPOFF);
                            var_r31->unkC = 2;
                            var_r27 = 1;
                        }
                        fn_1_3988(var_r31, 0, var_r27);
                    }
                    else {
                        temp_r30->pos.x = var_r31->unk18 + (var_f31 * (var_r31->unk1C - var_r31->unk18));
                    }
                    if (var_f31 > 0.1f) {
                        if (++var_r31->unk16 > 1) {
                            var_r31->unk16 = 0;
                            fn_1_44F0(*lbl_1_bss_E0->model, 130.0f + temp_r30->pos.x, 15.0f, 95.0f + temp_r30->pos.z, 1, 1);
                            fn_1_44F0(*lbl_1_bss_E0->model, 630.0f + temp_r30->pos.x, 15.0f, 95.0f + temp_r30->pos.z, 1, 1);
                        }
                    }
                    if ((var_r31->unk10 > 0.7f) && (var_r31->unk10 < 0.9f)) {
                        var_f31 = var_r31->unk10 - 3.5f;
                        if (++lbl_1_bss_1C > (40.0f * var_f31)) {
                            lbl_1_bss_1C = 0.0f;
                            var_f31 = 1.0f - var_f31;
                            fn_1_4FFC(lbl_1_bss_E0->model[1], 130.0f + temp_r30->pos.x, 20.0f + temp_r30->pos.y, 95.0f + temp_r30->pos.z,
                                (u8)(2.0f * var_f31));
                            fn_1_4FFC(
                                lbl_1_bss_E0->model[1], 630.0f + temp_r30->pos.x, 20.0f + temp_r30->pos.y, 95.0f + temp_r30->pos.z, (u8)var_f31);
                        }
                        if (var_r31->unk10 < (0.7f + var_f30)) {
                            HuAudFXEmiterPlay(0x55E, &temp_r30->pos);
                        }
                    }
                    Hu3DModelPosSet(var_r31->unk6, 70.0f + temp_r30->pos.x, 290.0f, -1200.0f);
                    Hu3DData[var_r31->unk4].pos.x = temp_r30->pos.x;
                    var_f31 = 0.8f * sind(180.0f * var_r31->unk10);
                    Hu3DMotionSpeedSet(var_r31->unk2, var_f31);
                }
            }
        }
        if (var_r23 == 4) {
            var_r22 = 0x63;
            lbl_1_bss_24.unk0 = 0;

