zeranemesis/Marioparty4/partyboard/src/REL/m409Dll/main.c
unkStruct5 *fn_1_58E0(s16 arg0, Vec *arg1, Vec *arg2, f32 arg3, GXColor *arg4)
{
    s16 var_r29;
    unkStruct5 *var_r31;
    unkStruct6 *temp_r30;
    HU3DMODEL *var_r28;

    var_r28 = &Hu3DData[arg0];
    temp_r30 = (unkStruct6 *)var_r28->hookData;

    var_r29 = 0;
    var_r31 = temp_r30->unk18;
    for (; var_r29 < temp_r30->unk0; var_r29++, var_r31++) {
        if (var_r31->unk4E == 0) {
            break;
        }
    }
    if (var_r29 == temp_r30->unk0) {
        return NULL;
    }
    temp_r30->unk24[var_r29].r = arg4->r;
    temp_r30->unk24[var_r29].g = arg4->g;
    temp_r30->unk24[var_r29].b = arg4->b;
    temp_r30->unk24[var_r29].a = arg4->a;
    var_r31->unk2E = var_r29;
    var_r31->unk30 = arg3;
    var_r31->unk34 = *arg2;
    var_r31->unk40 = *arg1;
    var_r31->unk4C = 0;
    var_r31->unk4E = 1;
    return var_r31;
}

s16 fn_1_5A18(ANIMDATA *arg0, s16 arg1, f32 arg8, s16 arg2, s16 arg3)
{
    HU3DMODEL *temp_r28;
    s16 var_r21;
    s16 var_r22;
    s16 var_r30;
    s16 var_r20;
    unkStruct6 *var_r31;
    void *var_r19;
    void *var_r18;
    unkStruct5 *var_r24;
    Vec *var_r25;
    GXColor *var_r27;
    HuVec2f *var_r29;

    var_r21 = Hu3DHookFuncCreate(fn_1_602C);
    temp_r28 = &Hu3DData[var_r21];
    var_r31 = HuMemDirectMallocNum(HEAP_DATA, sizeof(unkStruct6), temp_r28->mallocNo);
    temp_r28->hookData = var_r31;
    arg0->useNum++;
    var_r31->unk10 = arg0;
    var_r31->unk0 = arg1;
    var_r31->unk8 = 0;
    var_r31->unkC = NULL;
    var_r24 = HuMemDirectMallocNum(HEAP_DATA, arg1 * sizeof(unkStruct5), temp_r28->mallocNo);
    var_r31->unk18 = var_r24;

    for (var_r30 = 0; var_r30 < arg1; var_r30++, var_r24++) {
        var_r24->unk4C = -1;
        var_r24->unk4E = 0;
    }
    var_r25 = HuMemDirectMallocNum(HEAP_DATA, arg1 * sizeof(Vec) * 4, temp_r28->mallocNo);
    var_r31->unk1C = var_r25;

    for (var_r30 = 0; var_r30 < (arg1 * 4); var_r30++, var_r25++) {
        var_r25->x = var_r25->y = var_r25->z = 0.0f;
    }
    var_r27 = HuMemDirectMallocNum(HEAP_DATA, arg1 * sizeof(GXColor), temp_r28->mallocNo);
    var_r31->unk24 = var_r27;

    for (var_r30 = 0; var_r30 < arg1; var_r30++, var_r27++) {
        var_r27->r = var_r27->g = var_r27->b = var_r27->a = 0xFF;
    }
    var_r29 = HuMemDirectMallocNum(HEAP_DATA, arg1 * sizeof(HuVec2f) * 4, temp_r28->mallocNo);
    var_r31->unk20 = var_r29;

    for (var_r30 = 0; var_r30 < arg1; var_r30++) {
        var_r29->x = 0.0f;
        var_r29->y = 0.0f;
        var_r29++;
        var_r29->x = 1.0f;
        var_r29->y = 0.0f;
        var_r29++;
        var_r29->x = 1.0f;
        var_r29->y = 1.0f;
        var_r29++;
        var_r29->x = 0.0f;
        var_r29->y = 1.0f;
        var_r29++;
    }
    if ((arg2 != 0) || (arg3 != 0)) {
        var_r22 = arg0->bmp->sizeX / arg2;
        var_r20 = arg0->bmp->sizeY / arg3;
        var_r31->unk14 = (var_r22 * var_r20);
        var_r31->unk60 = (1.0f / var_r22);
        var_r31->unk64 = (1.0f / var_r20);
    }
    else {
        var_r22 = 1;
        var_r31->unk14 = 1;
        var_r31->unk60 = 1.0f;
        var_r31->unk64 = 1.0f;
    }
    var_r31->unk5C = HuMemDirectMallocNum(HEAP_DATA, var_r31->unk14 * sizeof(HuVec2f), temp_r28->mallocNo);
    fn_1_6608(var_r31->unk5C, var_r31->unk14, var_r22, var_r31->unk60, var_r31->unk64);
    var_r31->unk2C.x = var_r31->unk50.x = var_r31->unk44.y = var_r31->unk50.y = -arg8;
    var_r31->unk38.x = var_r31->unk44.x = var_r31->unk2C.y = var_r31->unk38.y = arg8;
    var_r31->unk2C.z = var_r31->unk38.z = var_r31->unk44.z = var_r31->unk50.z = 0.0f;
    var_r19 = var_r18 = HuMemDirectMallocNum(HEAP_DATA, 0x20000, temp_r28->mallocNo);
    DCFlushRange(var_r19, 0x20000);
    GXBeginDisplayList(var_r19, 0x20000);
    GXBegin(GX_QUADS, GX_VTXFMT0, (arg1 * 4));

    for (var_r30 = 0; var_r30 < arg1; var_r30++) {
        GXPosition1x16(var_r30 * 4);
        GXColor1x16(var_r30);
        GXTexCoord1x16(var_r30 * 4);
        GXPosition1x16((var_r30 * 4) + 1);
        GXColor1x16(var_r30);
        GXTexCoord1x16((var_r30 * 4) + 1);
        GXPosition1x16((var_r30 * 4) + 2);
        GXColor1x16(var_r30);
        GXTexCoord1x16((var_r30 * 4) + 2);
        GXPosition1x16((var_r30 * 4) + 3);
        GXColor1x16(var_r30);
        GXTexCoord1x16((var_r30 * 4) + 3);
    }
    GXEnd();
    var_r31->unk4 = GXEndDisplayList();
    var_r31->unk28 = HuMemDirectMallocNum(HEAP_DATA, var_r31->unk4, temp_r28->mallocNo);
    memcpy(var_r31->unk28, var_r18, var_r31->unk4);
    DCFlushRange(var_r31->unk28, var_r31->unk4);
    HuMemDirectFree(var_r18);
    return var_r21;
}

void fn_1_5F5C(s16 arg0)
{
    HU3DMODEL *var_r31;
    unkStruct6 *var_r30;

    var_r31 = &Hu3DData[arg0];
    var_r30 = (unkStruct6 *)var_r31->hookData;
    HuSprAnimKill(var_r30->unk10);
    Hu3DModelKill(arg0);
}

void fn_1_5FBC(s16 arg0, m409Func6 arg1)
{
    HU3DMODEL *var_r31;
    unkStruct6 *var_r30;

    var_r31 = &Hu3DData[arg0];
    var_r30 = (unkStruct6 *)var_r31->hookData;
    var_r30->unkC = arg1;
}

void fn_1_5FF4(s16 arg0, u8 arg1)
{
    HU3DMODEL *var_r31;
    unkStruct6 *var_r30;

    var_r31 = &Hu3DData[arg0];
    var_r30 = (unkStruct6 *)var_r31->hookData;
    var_r30->unk8 = arg1;
}

void fn_1_602C(HU3DMODEL *arg0, f32 (*arg1)[4])
{
    Mtx sp128;
    ROMtx spF8;
    Mtx spC8;
    Mtx sp98;
    Vec sp68[4];
    Vec sp38[4];
    Vec sp8[4];
    Vec *var_r31;
    s16 var_r24;
    HuVec2f *var_r26;
    s16 var_r25;
    unkStruct6 *temp_r30;
    unkStruct5 *var_r29;
    m409Func6 var_r23;

    temp_r30 = (unkStruct6 *)arg0->hookData;
    GXLoadPosMtxImm(arg1, 0);
    GXSetNumTevStages(1);
    GXSetNumTexGens(1);
    GXSetTexCoordGen2(GX_TEXCOORD0, GX_TG_MTX2x4, GX_TG_TEX0, GX_IDENTITY, GX_FALSE, GX_PTIDENTITY);
    GXSetTevOrder(GX_TEVSTAGE0, GX_TEXCOORD0, GX_TEXMAP0, GX_COLOR0A0);
    var_r24 = temp_r30->unk10->bmp->dataFmt & 0xF;
    if ((var_r24 == 7) || (var_r24 == 8)) {
        GXSetTevColorIn(GX_TEVSTAGE0, GX_CC_ZERO, GX_CC_ONE, GX_CC_RASC, GX_CC_ZERO);
    }
    else {
        GXSetTevColorIn(GX_TEVSTAGE0, GX_CC_ZERO, GX_CC_TEXC, GX_CC_RASC, GX_CC_ZERO);
    }
    GXSetTevColorOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    GXSetTevAlphaIn(GX_TEVSTAGE0, GX_CA_ZERO, GX_CA_TEXA, GX_CA_RASA, GX_CA_ZERO);
    GXSetTevAlphaOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    GXSetNumChans(1);
    GXSetChanCtrl(GX_COLOR0A0, GX_FALSE, GX_SRC_REG, GX_SRC_VTX, 0, GX_DF_CLAMP, GX_AF_NONE);
    if ((arg0->attr & 2) != 0) {
        GXSetZMode(GX_TRUE, GX_LEQUAL, GX_TRUE);
    }
    else {
        GXSetZMode(GX_TRUE, GX_LEQUAL, GX_FALSE);
    }
    HuSprTexLoad(temp_r30->unk10, 0, 0, GX_REPEAT, GX_REPEAT, GX_LINEAR);
    GXSetAlphaCompare(GX_GEQUAL, 1, GX_AOP_AND, GX_GEQUAL, 1);
    GXSetZCompLoc(0);
    switch (temp_r30->unk8) {
        case 0:
            GXSetBlendMode(GX_BM_BLEND, GX_BL_SRCALPHA, GX_BL_INVSRCALPHA, GX_LO_NOOP);
            break;
        case 1:
            GXSetBlendMode(GX_BM_BLEND, GX_BL_SRCALPHA, GX_BL_ONE, GX_LO_NOOP);
            break;
        case 2:
            GXSetBlendMode(GX_BM_BLEND, GX_BL_ZERO, GX_BL_INVDSTCLR, GX_LO_NOOP);
            break;
    }
    GXClearVtxDesc();
    GXSetVtxDesc(GX_VA_POS, GX_INDEX16);
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_POS, GX_POS_XYZ, GX_F32, 0);
    GXSETARRAY(GX_VA_POS, temp_r30->unk1C, temp_r30->unk0 * sizeof(Vec) * 4, sizeof(Vec), TRUE);
    GXSetVtxDesc(GX_VA_CLR0, GX_INDEX16);
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_CLR0, GX_CLR_RGBA, GX_RGBA8, 0);
    GXSETARRAY(GX_VA_CLR0, temp_r30->unk24, temp_r30->unk0 * sizeof(GXColor), sizeof(GXColor), TRUE);
    GXSetVtxDesc(GX_VA_TEX0, GX_INDEX16);
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_TEX0, GX_TEX_ST, GX_F32, 0);
    GXSETARRAY(GX_VA_TEX0, temp_r30->unk20, temp_r30->unk0 * sizeof(Vec2f) * 4, sizeof(Vec2f), TRUE);
    fn_1_40A4(arg1, sp128);
    MTXReorder(sp128, spF8);
    if (((u8)omPauseChk() == 0) && (temp_r30->unkC)) {
        var_r23 = temp_r30->unkC;
        var_r23(arg0, temp_r30, arg1);
    }
    var_r29 = temp_r30->unk18;
    var_r31 = temp_r30->unk1C;
    var_r26 = temp_r30->unk20;
    MTXROMultVecArray(spF8, &temp_r30->unk2C, &sp68[0], 4);

    for (var_r25 = 0; var_r25 < temp_r30->unk0; var_r25++, var_r29++, var_r26 += 4) {
        if (var_r29->unk4E == 0) {
            var_r31->x = var_r31->y = var_r31->z = 0.0f;
            var_r31++;
            var_r31->x = var_r31->y = var_r31->z = 0.0f;
            var_r31++;
            var_r31->x = var_r31->y = var_r31->z = 0.0f;
            var_r31++;
            var_r31->x = var_r31->y = var_r31->z = 0.0f;
            var_r31++;
        }
        else {
            if (var_r29->unk30 == 0.0f) {
                fn_1_6778(sp68, sp38, &var_r29->unk34, 4);
                VECAdd(&sp38[0], &var_r29->unk40, var_r31++);
                VECAdd(&sp38[1], &var_r29->unk40, var_r31++);
                VECAdd(&sp38[2], &var_r29->unk40, var_r31++);
                VECAdd(&sp38[3], &var_r29->unk40, var_r31++);
            }
            else {
                fn_1_6778(&temp_r30->unk2C, sp38, &var_r29->unk34, 4);
                MTXRotRad(spC8, 0x5A, 0.017453292f * var_r29->unk30);
                MTXConcat(sp128, spC8, sp98);
                MTXMultVecArray(sp98, sp38, sp8, 4);
                VECAdd(&sp8[0], &var_r29->unk40, var_r31++);
                VECAdd(&sp8[1], &var_r29->unk40, var_r31++);
                VECAdd(&sp8[2], &var_r29->unk40, var_r31++);
                VECAdd(&sp8[3], &var_r29->unk40, var_r31++);
            }
            if (var_r29->unk4C != -1) {
                fn_1_66D4(var_r26, temp_r30->unk5C, var_r29->unk4C, temp_r30->unk60, temp_r30->unk64);
            }
        }
    }
    DCFlushRangeNoSync(temp_r30->unk1C, temp_r30->unk0 * 0xC * 4);
    DCFlushRangeNoSync(temp_r30->unk20, temp_r30->unk0 * 8 * 4);
    PPCSync();
    GXCallDisplayList(temp_r30->unk28, temp_r30->unk4);
}

void fn_1_6608(HuVec2f *arg0, s16 arg1, s16 arg2, f32 arg3, f32 arg4)
{
    s16 var_r31;
    s16 var_r30;
    s16 var_r29;

    for (var_r31 = 0; var_r31 < arg1; var_r31++, arg0++) {
        var_r30 = (var_r31 % arg2);
        var_r29 = (var_r31 / arg2);
        arg0->x = (var_r30 * arg3);
        arg0->y = (var_r29 * arg4);
    }
}

void fn_1_66D4(HuVec2f *arg0, HuVec2f *arg1, s16 arg2, f32 arg3, f32 arg4)
{
    arg0[0].x = arg1[arg2].x;
    arg0[0].y = arg1[arg2].y;
    arg0[1].x = (arg3 + arg1[arg2].x);
    arg0[1].y = arg1[arg2].y;
    arg0[2].x = (arg3 + arg1[arg2].x);
    arg0[2].y = (arg4 + arg1[arg2].y);
    arg0[3].x = arg1[arg2].x;
    arg0[3].y = (arg4 + arg1[arg2].y);
}

void fn_1_6778(Vec *arg0, Vec *arg1, Vec *arg2, s16 arg3)
{
    s16 var_r31;

    for (var_r31 = 0; var_r31 < arg3; var_r31++, arg0++, arg1++) {
        arg1->x = arg0->x * arg2->x;
        arg1->y = arg0->y * arg2->y;
        arg1->z = arg0->z * arg2->z;
    }
}
